RT-Thread/rt-thread/bsp/efm32/Libraries/Device/EnergyMicro/EFM32GG/Include/efm32gg_usb.h
/* Bit fields for USB FIFO12D_FIFO12D */
#define _USB_FIFO12D_FIFO12D_RESETVALUE            0x00000000UL                                /**< Default value for USB_FIFO12D_FIFO12D */
#define _USB_FIFO12D_FIFO12D_MASK                  0xFFFFFFFFUL                                /**< Mask for USB_FIFO12D_FIFO12D */
#define _USB_FIFO12D_FIFO12D_FIFO12D_SHIFT         0                                           /**< Shift value for USB_FIFO12D */
#define _USB_FIFO12D_FIFO12D_FIFO12D_MASK          0xFFFFFFFFUL                                /**< Bit mask for USB_FIFO12D */
#define _USB_FIFO12D_FIFO12D_FIFO12D_DEFAULT       0x00000000UL                                /**< Mode DEFAULT for USB_FIFO12D_FIFO12D */
#define USB_FIFO12D_FIFO12D_FIFO12D_DEFAULT        (_USB_FIFO12D_FIFO12D_FIFO12D_DEFAULT << 0) /**< Shifted mode DEFAULT for USB_FIFO12D_FIFO12D */

/* Bit fields for USB FIFO13D_FIFO13D */
#define _USB_FIFO13D_FIFO13D_RESETVALUE            0x00000000UL                                /**< Default value for USB_FIFO13D_FIFO13D */
#define _USB_FIFO13D_FIFO13D_MASK                  0xFFFFFFFFUL                                /**< Mask for USB_FIFO13D_FIFO13D */
#define _USB_FIFO13D_FIFO13D_FIFO13D_SHIFT         0                                           /**< Shift value for USB_FIFO13D */
#define _USB_FIFO13D_FIFO13D_FIFO13D_MASK          0xFFFFFFFFUL                                /**< Bit mask for USB_FIFO13D */
#define _USB_FIFO13D_FIFO13D_FIFO13D_DEFAULT       0x00000000UL                                /**< Mode DEFAULT for USB_FIFO13D_FIFO13D */
#define USB_FIFO13D_FIFO13D_FIFO13D_DEFAULT        (_USB_FIFO13D_FIFO13D_FIFO13D_DEFAULT << 0) /**< Shifted mode DEFAULT for USB_FIFO13D_FIFO13D */

/* Bit fields for USB FIFORAM_FIFORAM */
#define _USB_FIFORAM_FIFORAM_RESETVALUE            0x00000000UL                                /**< Default value for USB_FIFORAM_FIFORAM */
#define _USB_FIFORAM_FIFORAM_MASK                  0xFFFFFFFFUL                                /**< Mask for USB_FIFORAM_FIFORAM */
#define _USB_FIFORAM_FIFORAM_FIFORAM_SHIFT         0                                           /**< Shift value for USB_FIFORAM */
#define _USB_FIFORAM_FIFORAM_FIFORAM_MASK          0xFFFFFFFFUL                                /**< Bit mask for USB_FIFORAM */
#define _USB_FIFORAM_FIFORAM_FIFORAM_DEFAULT       0x00000000UL                                /**< Mode DEFAULT for USB_FIFORAM_FIFORAM */
#define USB_FIFORAM_FIFORAM_FIFORAM_DEFAULT        (_USB_FIFORAM_FIFORAM_FIFORAM_DEFAULT << 0) /**< Shifted mode DEFAULT for USB_FIFORAM_FIFORAM */

/** @} End of group EFM32GG_USB */


